AchimPieters/esp32-lifecycle-manager/example/led/main/main.c
/**
   Copyright 2025 Achim Pieters | StudioPieters®

   Permission is hereby granted, free of charge, to any person obtaining a copy
   of this software and associated documentation files (the "Software"), to deal
   in the Software without restriction, including without limitation the rights
   to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   copies of the Software, and to permit persons to whom the Software is
   furnished to do so, subject to the following conditions:

   The above copyright notice and this permission notice shall be included in all
   copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   FITNESS FOR A PARTICULAR PURPOSE AND NON INFRINGEMENT. IN NO EVENT SHALL THE
   AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
   WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

   for more information visit https://www.studiopieters.nl
 **/
 
#include <stdio.h>
#include <esp_log.h>
#include <nvs_flash.h>
#include <esp_system.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <driver/gpio.h>
#include <homekit/homekit.h>
#include <homekit/characteristics.h>

#include "esp32-wifi.h"   // <— nieuwe wifi module

// Custom error handling macro
#define CHECK_ERROR(x) do {                        \
                esp_err_t __err_rc = (x);                  \
                if (__err_rc != ESP_OK) {                  \
                        ESP_LOGE("INFORMATION", "Error: %s", esp_err_to_name(__err_rc)); \
                        handle_error(__err_rc);            \
                }                                          \
} while(0)

void handle_error(esp_err_t err) {
        // Simpel fallback: herstart device bij kritieke fouten
        ESP_LOGE("ERROR", "Critical error, restarting device... (%s)", esp_err_to_name(err));
        esp_restart();
}

// LED control
#define LED_GPIO CONFIG_ESP_LED_GPIO
bool led_on = false;

// Button (boot-knop op GPIO0)
#define BUTTON_GPIO 0
#define BUTTON_ACTIVE_LEVEL 0
#define BUTTON_DEBOUNCE_MS 50
#define BUTTON_DOUBLE_CLICK_MS 500
#define BUTTON_POLL_INTERVAL_MS 10
#define BUTTON_LONG_PRESS_MS 3000

static const char *BUTTON_TAG = "BUTTON";

void led_write(bool on) {
        gpio_set_level(LED_GPIO, on ? 1 : 0);
}

static void restart_device(void) {
        ESP_LOGI("RESTART", "Systeem wordt opnieuw opgestart");
        vTaskDelay(pdMS_TO_TICKS(200));
        esp_restart();
}

static void handle_button_single_click(void) {
        ESP_LOGI(BUTTON_TAG, "Single click gedetecteerd – geen actie nodig");
}

static void handle_button_double_click(void) {
        ESP_LOGW(BUTTON_TAG, "Double click gedetecteerd – HomeKit-instellingen resetten");
        homekit_server_reset();
        restart_device();
}

static void handle_button_long_press(void) {
        ESP_LOGW(BUTTON_TAG, "Long press gedetecteerd – Factory reset uitvoeren");
        homekit_server_reset();
        esp_err_t err = wifi_reset_settings();
        if (err != ESP_OK) {
                ESP_LOGE("RESET", "WiFi-configuratie kon niet worden gewist: %s", esp_err_to_name(err));
        }
        restart_device();
}

// All GPIO Settings
void gpio_init() {
        gpio_reset_pin(LED_GPIO); // Reset GPIO pin to avoid conflicts
        gpio_set_direction(LED_GPIO, GPIO_MODE_OUTPUT);
        led_write(led_on);

        gpio_reset_pin(BUTTON_GPIO);
        gpio_config_t button_config = {
                .pin_bit_mask = 1ULL << BUTTON_GPIO,
                .mode = GPIO_MODE_INPUT,
                .pull_up_en = GPIO_PULLUP_ENABLE,
                .pull_down_en = GPIO_PULLDOWN_DISABLE,
                .intr_type = GPIO_INTR_DISABLE,
        };
        CHECK_ERROR(gpio_config(&button_config));
}

// Accessory identification
void accessory_identify_task(void *args) {
        for (int i = 0; i < 3; i++) {
                for (int j = 0; j < 2; j++) {
                        led_write(true);
                        vTaskDelay(pdMS_TO_TICKS(100));
                        led_write(false);
                        vTaskDelay(pdMS_TO_TICKS(100));
                }
                vTaskDelay(pdMS_TO_TICKS(250));
        }
        led_write(led_on);
        vTaskDelete(NULL);
}

void accessory_identify(homekit_value_t _value) {
        ESP_LOGI("INFORMATION", "Accessory identify");
        xTaskCreate(accessory_identify_task, "Accessory identify", configMINIMAL_STACK_SIZE, NULL, 2, NULL);
}

homekit_value_t led_on_get() {
        return HOMEKIT_BOOL(led_on);
}

void led_on_set(homekit_value_t value) {
        if (value.format != homekit_format_bool) {
                ESP_LOGE("ERROR", "Invalid value format: %d", value.format);
                return;
        }
        led_on = value.bool_value;
        led_write(led_on);
}

// HomeKit characteristics
#define DEVICE_NAME "HomeKit LED"
#define DEVICE_MANUFACTURER "StudioPieters®"
#define DEVICE_SERIAL "NLDA4SQN1466"
#define DEVICE_MODEL "SD466NL/A"
#define FW_VERSION "0.0.1"

homekit_characteristic_t name = HOMEKIT_CHARACTERISTIC_(NAME, DEVICE_NAME);
homekit_characteristic_t manufacturer = HOMEKIT_CHARACTERISTIC_(MANUFACTURER,  DEVICE_MANUFACTURER);
homekit_characteristic_t serial = HOMEKIT_CHARACTERISTIC_(SERIAL_NUMBER, DEVICE_SERIAL);
homekit_characteristic_t model = HOMEKIT_CHARACTERISTIC_(MODEL, DEVICE_MODEL);
homekit_characteristic_t revision = HOMEKIT_CHARACTERISTIC_(FIRMWARE_REVISION, FW_VERSION);

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Woverride-init"
homekit_accessory_t *accessories[] = {
        HOMEKIT_ACCESSORY(.id = 1, .category = homekit_accessory_category_lighting, .services = (homekit_service_t*[]) {
                HOMEKIT_SERVICE(ACCESSORY_INFORMATION, .characteristics = (homekit_characteristic_t*[]) {
                        &name,
                        &manufacturer,
                        &serial,
                        &model,
                        &revision,
                        HOMEKIT_CHARACTERISTIC(IDENTIFY, accessory_identify),
                        NULL
                }),
                HOMEKIT_SERVICE(LIGHTBULB, .primary = true, .characteristics = (homekit_characteristic_t*[]) {
                        HOMEKIT_CHARACTERISTIC(NAME, "HomeKit LED"),
                        HOMEKIT_CHARACTERISTIC(ON, false, .getter = led_on_get, .setter = led_on_set),
                        NULL
                }),
                NULL
        }),
        NULL
};
#pragma GCC diagnostic pop

homekit_server_config_t config = {
        .accessories = accessories,
        .password = CONFIG_ESP_SETUP_CODE,
        .setupId = CONFIG_ESP_SETUP_ID,
};

static void on_wifi_ready(void) {
        ESP_LOGI("INFORMATION", "Starting HomeKit server...");
        homekit_server_init(&config);
}

static void button_task(void *args) {
        bool raw_state = gpio_get_level(BUTTON_GPIO);
        bool stable_state = raw_state;
        bool pressed = (stable_state == BUTTON_ACTIVE_LEVEL);
        TickType_t last_change = xTaskGetTickCount();
        TickType_t press_start = 0;
        bool long_press_triggered = false;
        uint8_t click_count = 0;
        bool awaiting_second_click = false;
        TickType_t last_release_time = 0;

        while (true) {
                TickType_t now = xTaskGetTickCount();
                bool current_state = gpio_get_level(BUTTON_GPIO);

                if (current_state != raw_state) {
                        raw_state = current_state;
                        last_change = now;
                }

                if ((now - last_change) >= pdMS_TO_TICKS(BUTTON_DEBOUNCE_MS) && current_state != stable_state) {
                        stable_state = current_state;
                        bool is_pressed = (stable_state == BUTTON_ACTIVE_LEVEL);

                        if (is_pressed) {
                                pressed = true;
                                press_start = now;
                                long_press_triggered = false;
                        } else {
                                pressed = false;
                                if (long_press_triggered) {
                                        long_press_triggered = false;
                                } else {
                                        click_count++;
                                        awaiting_second_click = true;
                                        last_release_time = now;
                                        if (click_count >= 2) {
                                                awaiting_second_click = false;
                                                click_count = 0;
                                                handle_button_double_click();
                                        }
                                }
                        }
                } else if (pressed && !long_press_triggered &&
                           (now - press_start) >= pdMS_TO_TICKS(BUTTON_LONG_PRESS_MS)) {
                        long_press_triggered = true;
                        awaiting_second_click = false;
                        click_count = 0;
                        handle_button_long_press();
                }

                if (awaiting_second_click && !pressed &&
                    (now - last_release_time) >= pdMS_TO_TICKS(BUTTON_DOUBLE_CLICK_MS)) {
                        if (click_count == 1) {
                                handle_button_single_click();
                        }
                        awaiting_second_click = false;
                        click_count = 0;
                }

                vTaskDelay(pdMS_TO_TICKS(BUTTON_POLL_INTERVAL_MS));
        }
}

void app_main(void) {
        // NVS init (vereist voor WiFi module om keys te lezen)
        esp_err_t ret = nvs_flash_init();
        if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
                ESP_LOGW("WARNING", "NVS flash initialization failed, erasing...");
                CHECK_ERROR(nvs_flash_erase());
                ret = nvs_flash_init();
        }
        CHECK_ERROR(ret);

        // Start GPIO / LED
        gpio_init();

        if (xTaskCreate(button_task, "button_task", 4096, NULL, 5, NULL) != pdPASS) {
                ESP_LOGE(BUTTON_TAG, "Kan button_task niet starten");
        }

        // Start WiFi op basis van NVS en geef callback door
        CHECK_ERROR(wifi_start(on_wifi_ready));
}
